package example.ch06;

public class OOP09 {
    public static void main(String[] args){
        /**
         *    - 메서드란?
         *      1. 객체지향 용어에서 함수를 지칭하는 용어.
         *          - 함수와 다른 이유는 꼭 클래스안에 있어야하는데, 함수는 클래스에 독립적(따로 존재)입니다.
         *      2. 문장들을 {괄호}로 묶어놓은 것.
         *          - 작업단위로 문장들을 묶어서 이름을 붙인 것.
         *      3. 값(입력)을 받아서 처리하고, 결과를 반환(출력)
         *
         *          ex) int add(int x, int y) { // == 반환타입(출력) 메서드이름 (매개변수선언(입력)) { return 결과반환 };
         *                  int result = x + y;
         *                  return result; //결과를 반환
         *              }
         *      4. Blackbox : 뭔가를 입력하면 뭔가를 출력하기에 해당 용어로 불리기도 한다.
         *
         *    - 메서드의 장점
         *      1. 코드의 중복을 줄일 수 있다.
         *      2. 코드의 관리가 쉽다.
         *      3. 코드를 재사용할 수 있다.
         *      4. 코드가 간결해서 이해하기 쉬워진다.
         *
         *
         *    - 메서드의 작성
         *      - 반복적으로 수행되는..
         */

    }
}
