package example.ch06;

public class OOP16 {
    public static void main(String[] args){
        /**
         *    - 생성자(constructor)
         *      인스턴스가 생성될 때마다 호출되는 '인스턴스 초기화 메서드'
         *      인스턴스 생성시 수행할 작업(인스턴스 변수 초기화)에 사용
         *
         *      이름이 클래스 이름과 같아야 한다.
         *      리턴값이 없다.(void 안 붙혀도 된다.)
         *      모든 클래스는 반드시 생성자를 가져야 한다.
         *
         *          클래스이름(타입 변수명, 타입 변수명, ...) {
         *              //인스턴스 생성 시 수행될 코드
         *              // 주로 인스턴스 변수의 초기화 코드를 적는다.
         *          }
         *
         */


    }
}
