package example.ch06;

public class OOP14 {
    public static void main(String[] args){
        /**
         *    - static 메서드와 인스턴스 메서드
         *
         *      1. 인스턴스 메서드
         *         - 인스턴스 생성 후, '참조변수.메서드이름()'으로 호출
         *         - 인스턴스 멤버(인스턴스 변수, 인스턴스 메서드)와 관련된 작업을 하는 메서드
         *         - 메서드 내에서 인스턴스 변수 사용 가능
         *
         *      2. static 메서드(클래스메서드)  ex) Math.random(), 객체생성 X
         *         - 객체 생성없이 '클래스이름.메서드이름()'으로 호출
         *         - 인스턴스 멤버와 관련없는 작업을 하는 메서드
         *         - 메서드 내에서 인스턴스 변수 사용불가
         *
         *      간단히 말해, 이 두 메서드의 차이점은 인스턴스 변수의 사용여부에 따라 다르다.
         */

    }
}
